app/controllers/image/register_controller.rb

DELETE FROM "tmp_images" WHERE "tmp_images"."id" = ?  [["id", 1]]
DELETE FROM "text_blocks" WHERE "text_blocks"."id" = ?  [["id", 1]]
---
  def reset
    # データベースの中身を削除する
    Image.delete_all
    TmpImage.delete_all
    TextBlock.delete_all