app/controllers/image/register_controller.rb

  def index
    tmp = TmpImage.first
---
SELECT  "tmp_images".* FROM "tmp_images" ORDER BY "tmp_images"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def register
    pos = params[:pos]
    text = TextBlock.create(
      image_id: TmpImage.first[:image_id],
      text: pos[:text],
      x1: pos[:pos1_x1],  y1: pos[:pos1_y1],
      x2: pos[:pos2_x2],  y2: pos[:pos2_y2]
    )
---
INSERT INTO "text_blocks" ("image_id", "text", "x1", "x2", "y1", "y2", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["image_id", 1], ["text", "テスト"], ["x1", 61], ["x2", 252], ["y1", 77], ["y2", 94], ["created_at", 2016-10-31 06:57:14 UTC], ["updated_at", 2016-10-31 06:57:14 UTC]]
SELECT  "tmp_images".* FROM "tmp_images" ORDER BY "tmp_images"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def next
    # 現状の画像を完了に
    tmp = TmpImage.first
    image = Image.find_by(filename: tmp[:filename])
    image.update_attribute(:is_complete, true)
    # 新しい画像に切り替える
    files = Dir::entries("app/assets/images/")
    files.each do |file|
      if file.include?(".jpg") || file.include?(".png") || file.include?(".jpeg")
        # ファイル名が既に書き込まれていないか確認
        db_files = Image.where(filename: file)
        if db_files.empty?
          image = Image.create(filename: file)
---
SELECT  "tmp_images".* FROM "tmp_images" ORDER BY "tmp_images"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "images".* FROM "images" WHERE "images"."filename" = ? LIMIT ?  [["filename", "tegaki01.jpg"], ["LIMIT", 1]]
UPDATE "tmp_images" SET "filename" = ?, "updated_at" = ? WHERE "tmp_images"."id" = ?  [["filename", "tegaki02.jpg"], ["updated_at", 2016-10-31 06:13:57 UTC], ["id", 1]]
SELECT COUNT(*) FROM "images" WHERE "images"."filename" = ?  [["filename", "tegaki01.jpg"]]
INSERT INTO "images" ("filename", "created_at", "updated_at") VALUES (?, ?, ?)  [["filename", "tegaki02.jpg"], ["created_at", 2016-10-31 06:29:43 UTC], ["updated_at", 2016-10-31 06:29:43 UTC]]

  def delete
    TextBlock.last.delete
---
DELETE FROM "text_blocks" WHERE "text_blocks"."id" = ?  [["id", 8]]
SELECT  "text_blocks".* FROM "text_blocks" ORDER BY "text_blocks"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def reset
    Image.all.each do |t|
      t.delete
    end
    TmpImage.all.each do |t|
      t.delete
    end
    TextBlock.all.each do |t|
      t.delete
    end
    image = Image.create(filename:"image_sample_01.png")
---
SELECT "tmp_images".* FROM "tmp_images"
SELECT "text_blocks".* FROM "text_blocks"
INSERT INTO "tmp_images" ("filename", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["filename", "tegaki01.jpg"], ["image_id", 1], ["created_at", 2016-10-31 06:25:32 UTC], ["updated_at", 2016-10-31 06:25:32 UTC]]